app/controllers/admin/states_controller.rb

  def index
    @states = State.all
---
SELECT `states`.* FROM `states`

  def make_default
    @state = State.find(params[:id])
---
SELECT `states`.* FROM `states` WHERE `states`.`id` = ? LIMIT 1  [["id", "1"]]