app/controllers/admin/users_controller.rb

  def index
    @users = User.all(:order => "email")
---
SELECT `users`.* FROM `users` ORDER BY email

  def create
    @user = User.new(params[:user])
    set_admin
    if @user.save
---
INSERT INTO `users` (`admin`, `confirmation_sent_at`, `confirmation_token`, `confirmed_at`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_sign_in_at`, `last_sign_in_ip`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if params[:user][:password].blank?
      params[:user].delete(:password)
      params[:user].delete(:password_confirmation)
    end
    set_admin
    if @user.update_attributes(params[:user])
---
UPDATE `users` SET `email` = 'user@ticketee.com', `encrypted_password` = '$2a$10$L8cHX.DeEBkZ5fFnJEVtuOjnqaX0azGx3Pf9uFTgaLSPlIZPSzBbS', `updated_at` = '2011-10-10 16:04:21' WHERE `users`.`id` = 5

  def find_user
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1