app/views/tickets/show.html.erb

SELECT `assets`.* FROM `assets` WHERE `assets`.`ticket_id` = 4
---
    <%= simple_format(@ticket.description) %>
    <% if @ticket.assets.exists? %>