app/controllers/comments_controller.rb

  def create
    @comment = @ticket.comments.build(params[:comment].merge(:user =>current_user))
    if @comment.save
      flash[:notice] = "Comment has been created."
      redirect_to [@ticket.project, @ticket]
    else
      @states = State.all
---
INSERT INTO `comments` (`created_at`, `text`, `ticket_id`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 10 Oct 2011 08:10:06 UTC +00:00], ["text", "Tengo un comentario"], ["ticket_id", 1], ["updated_at", Mon, 10 Oct 2011 08:10:06 UTC +00:00], ["user_id", 2]]
SELECT `states`.* FROM `states`

  def find_ticket
    @ticket = Ticket.find(params[:ticket_id])
---
SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = ? LIMIT 1  [["id", "1"]]