app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
    def index
       @projects = Project.for(current_user).all

INSERT INTO `projects` (`created_at`, `name`, `updated_at`) VALUES (?, ?, ?)  [["created_at", Tue, 04 Oct 2011 07:46:51 UTC +00:00], ["name", "alba"], ["updated_at", Tue, 04 Oct 2011 07:46:51 UTC +00:00]]
---
    def create
       @project = Project.new(params[:project])
       if @project.save

UPDATE `projects` SET `name` = 'TextMate 2 beta', `updated_at` = '2011-10-04 10:32:35' WHERE `projects`.`id` = 7
---
    def update
     #@project = Project.find(params[:id])
     if @project.update_attributes(params[:project])

DELETE FROM `projects` WHERE `projects`.`id` = ?  [["id", 28]]
---
    def destroy
      #@project = Project.find(params[:id])
      @project.destroy

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = ? LIMIT 1  [["id", "28"]]
---
     def find_project
       @project = Project.for(current_user).find(params[:id])